// Подготовил Раевский Р.Ю.

// Task 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. 
// Выполнить с помощью рекурсии.

/* void Numbers(int N)
{
    Console.Write(N+" ");
    if(N>1)  Numbers(N-1);
}

Console.Write("Введите целое число: ");
int num = Convert.ToInt32(Console.ReadLine());

Numbers(num);
*/
